#+options: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Clojure x ClojureScript で深める Web 開発 (1) ~Duct x Clean Architecture~
#+date: <2021-03-08 Mon>
#+author: MokkeMeguru
#+email: meguru.mokke@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.4)

本稿は、Clojure における アプリ開発フレームワーク integrant をベースとして Clean Architecture を採用した API サーバ開発の基礎を紹介します。
** エラーハンドリング
threading macro が可読性を高める手法であることを見ていただけられたところで、一つ、実務上の問題が発生します。
そう、エラーハンドリングです。

各処理工程で何らかのエラーがあった際に、それ以降の処理をするのは非効率だと言えます。なので、例えば golang などでは ~return~ を用いて処理を打ち切る手法が多く取られます。
ところが Clojure では、 ~if-else~ はあっても途中で処理を切り上げる ~return~ を実現するのは難しいです。仮に ~if-else~ を用いて処理を記述すると、括弧を処理単位とする性質上、ネストが深くなってしまい、可読性を下げてしまいます。

そのため、次のような関数とマクロ ~bind-error~ 、 ~err->>~ を用いることで、エラーハンドリングを行います。

#+BEGIN_SRC clojure
(defn bind-error [f [val err]]
  (if (nil? err)
    (f val)
    [nil err]))

(defmacro err->> [val & fns]
  (let [fns (for [f fns] `(bind-error ~f))]
    `(->> [~val nil]
          ~@fns)))
#+END_SRC

#+RESULTS:
| #'user/bind-error |
| #'user/err->>     |

やや複雑な関数のため詳細の説明は省略し、例を用いて使い方を説明すると次のような形になります。

#+BEGIN_SRC clojure
(defn start-with-H? [param]
  (if (.startsWith (:call param) "H")
    [param nil]
    [nil "is not start of H"]))

(defn end-with-!? [param]
  (if (.endsWith (:call param) "!")
    [param nil]
    [nil "is not end of !"]))

;; 実行例
;; success
(err->>
  {:call "Hello!"}
  start-with-H?
  end-with-!?)
;; -> [{:call "Hello!"} nil]

;; failure 1
(err->>
  {:call "hello"}
  start-with-H?
  end-with-!?)
;; -> [nil "is not start of H"]

;;failure 2
(err->>
  {:call "Hello"}
  start-with-H?
  end-with-!?)
;; -> [nil "is not end of !"]
#+END_SRC

#+RESULTS:
| #'user/start-with-H?   |
| #'user/end-with-!?     |
| [{:call "Hello!"} ]    |
| [ "is not start of H"] |
| [ "is not end of !"]   |


重要なところは返り値が ~[success-response failure-error-or-nil]~ となっていることです。
2番目の要素 ~failure-error-or-nil~ がエラーの判定とエラー内容を表しており、関数 ~bind-error~ によって、エラーがあれば以降の処理を実行しない機能が実現されています。
